{
    "BTC": {
        "coin_name": "Bitcoin",
        "description": "Bitcoin is the first successful internet money based on peer-to-peer technology; whereby no central bank or authority is involved in the transaction and production of the Bitcoin currency. It was created by an anonymous individual/group under the name, Satoshi Nakamoto. The source code is available publicly as an open source project, anybody can look at it and be part of the developmental process.\r\n\r\nBitcoin is changing the way we see money as we speak. The idea was to produce a means of exchange, independent of any central authority, that could be transferred electronically in a secure, verifiable and immutable way. It is a decentralized peer-to-peer internet currency making mobile payment easy, very low transaction fees, protects your identity, and it works anywhere all the time with no central authority and banks.\r\n\r\nBitcoin is designed to have only 21 million BTC ever created, thus making it a deflationary currency. Bitcoin uses the SHA-256 hashing algorithm with an average transaction confirmation time of 10 minutes. Miners today are mining Bitcoin using ASIC chip dedicated to only mining Bitcoin, and the hash rate has shot up to peta hashes.\r\n\r\nBeing the first successful online cryptography currency, Bitcoin has inspired other alternative currencies such as Litecoin, Peercoin, Primecoin, and so on.\r\n\r\nThe cryptocurrency then took off with the innovation of the turing-complete smart contract by Ethereum which led to the development of other amazing projects such as EOS, Tron, and even crypto-collectibles such as CryptoKitties.",
        "current_price": 110111.0,
        "price_change_24h": -0.30751,
        "high_24h": 110450.0,
        "low_24h": 106464.0,
        "market_cap": 2195648214647.0,
        "total_volume": 48523456789.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "FTX Holdings",
            "Proof of Work (PoW)",
            "Bitcoin Ecosystem",
            "GMCI 30 Index",
            "GMCI Index",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/1/thumb/bitcoin.png?1696501400",
        "coin_page_id": 0
    },
    "ETH": {
        "coin_name": "Ethereum",
        "description": "Ethereum is a global, open-source platform for decentralized applications. In other words, the vision is to create a world computer that anyone can build applications in a decentralized manner; while all states and data are distributed and publicly accessible. Ethereum supports smart contracts in which developers can write code in order to program digital value. Examples of decentralized apps (dapps) that are built on Ethereum includes tokens, non-fungible tokens, decentralized finance apps, lending protocol, decentralized exchanges, and much more.\r\n\r\nOn Ethereum, all transactions and smart contract executions require a small fee to be paid. This fee is called Gas. In technical terms, Gas refers to the unit of measure on the amount of computational effort required to execute an operation or a smart contract. The more complex the execution operation is, the more gas is required to fulfill that operation. Gas fees are paid entirely in Ether (ETH), which is the native coin of the blockchain. The price of gas can fluctuate from time to time depending on the network demand.",
        "current_price": 3848.15,
        "price_change_24h": -1.61031,
        "high_24h": 3911.13,
        "low_24h": 3687.02,
        "market_cap": 464613683519.0,
        "total_volume": 21456789012.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Ethereum Ecosystem",
            "FTX Holdings",
            "Multicoin Capital Portfolio",
            "Proof of Stake (PoS)",
            "Alameda Research Portfolio",
            "Andreessen Horowitz (a16z) Portfolio",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "Delphi Ventures Portfolio",
            "Galaxy Digital Portfolio",
            "GMCI Index",
            "World Liberty Financial Portfolio",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/279/thumb/ethereum.png?1696501628",
        "coin_page_id": 1
    },
    "USDT": {
        "coin_name": "Tether",
        "description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex).\r\n\r\nThe digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that.\r\n\r\nUSDT is fairly simple to use. Once on exchanges like Poloniex or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account.\r\n\r\n",
        "current_price": 1.0,
        "price_change_24h": -0.02302,
        "high_24h": 1.0,
        "low_24h": 0.999838,
        "market_cap": 183396998352.0,
        "categories": [
            "Stablecoins",
            "USD Stablecoin",
            "Solana Ecosystem",
            "Avalanche Ecosystem",
            "Near Protocol Ecosystem",
            "Celo Ecosystem",
            "Ethereum Ecosystem",
            "Kaia Ecosystem",
            "Aptos Ecosystem",
            "FTX Holdings",
            "TON Ecosystem",
            "Tron Ecosystem",
            "Kava Ecosystem",
            "Fiat-backed Stablecoin",
            "World Liberty Financial Portfolio"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/325/thumb/Tether.png?1696501661",
        "coin_page_id": 2
    },
    "BNB": {
        "coin_name": "Binance Coin",
        "description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name \"Binance\" is a combination of binary and finance.\r\n\r\nThus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing.\r\n\r\nIn total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB. \r\n\r\nThe schedule of BNB fees discount is as follow: In the first year, 50% discount on all fees, second year 25% discount, third year 12.5% discount, fourth year 6.75 % discount, and from the fifth year onwards there is no discount. This structure is used to incentivize users to buy BNB and do trades within Binance.\r\n\r\nBinance announced in a buyback plan that it would buy back up to 100 million BNB in Q1 2018. The coins are then burned. This means that they are devaluated to increase the value of the remaining coins. This benefits investors. In the future, the cryptocurrency will remain an asset on the trading platform and will be used as gas.\r\n\r\nOther tokens that are issued by exchanges include Bibox Token, OKB, Huobi Token, and more.",
        "current_price": 1096.79,
        "price_change_24h": -1.3057,
        "high_24h": 1126.35,
        "low_24h": 1049.67,
        "market_cap": 151068971077.0,
        "categories": [
            "Smart Contract Platform",
            "Exchange-based Tokens",
            "BNB Chain Ecosystem",
            "Centralized Exchange (CEX) Token",
            "Layer 1 (L1)",
            "Ethereum Ecosystem",
            "Alleged SEC Securities",
            "FTX Holdings",
            "Proof of Stake (PoS)",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "GMCI Index",
            "Made in China"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/825/thumb/bnb-icon2_2x.png?1696501970",
        "coin_page_id": 3
    },
    "SOL": {
        "coin_name": "Solana",
        "description": "Solana is a highly functional open source project that banks on blockchain technology’s permissionless nature to provide decentralized finance (DeFi) solutions. It is a layer 1 network that offers fast speeds and affordable costs. While the idea and initial work on the project began in 2017, Solana was officially launched in March 2020 by the Solana Foundation with headquarters in Geneva, Switzerland.",
        "current_price": 186.36,
        "price_change_24h": -4.04364,
        "high_24h": 194.22,
        "low_24h": 179.42,
        "market_cap": 102460631880.0,
        "categories": [
            "Smart Contract Platform",
            "Solana Ecosystem",
            "Layer 1 (L1)",
            "Alleged SEC Securities",
            "FTX Holdings",
            "Multicoin Capital Portfolio",
            "Proof of Stake (PoS)",
            "Alameda Research Portfolio",
            "Andreessen Horowitz (a16z) Portfolio",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "Delphi Ventures Portfolio",
            "GMCI Index",
            "Polychain Capital Portfolio",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/4128/thumb/solana.png?1718769756",
        "coin_page_id": 4
    },
    "ADA": {
        "coin_name": "Cardano",
        "description": "Cardano is a proof-of-stake blockchain platform designed to support decentralized applications (dApps), featuring a multi-asset ledger and smart contract functionality. Unlike many other blockchains, Cardano is built from the ground up based on original academic research, with proposed solutions undergoing peer review and presentation at international conferences before development. The platform emphasizes a research-driven and formal methods approach to design and implementation.",
        "current_price": 0.614404,
        "price_change_24h": -3.55301,
        "high_24h": 0.637038,
        "low_24h": 0.58857,
        "market_cap": 22471195722.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Cardano Ecosystem",
            "Alleged SEC Securities",
            "Proof of Stake (PoS)",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "GMCI Index",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/975/thumb/cardano.png?1696502090",
        "coin_page_id": 5
    },
    "XRP": {
        "coin_name": "Ripple",
        "description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time.\r\n\r\nRipple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence. Where bitcoin has a continually growing pool with an eventual maximum, and Ethereum theoretically has no limit, Ripple was created with all of its 100 billion XRP tokens right out of the gate. That number is maintained with no mining and most of the tokens are owned and held by Ripple Labs itself — around 60 billion at the latest count.\r\n\r\nEven at the recently reduced value of around half a dollar per XRP, that means Ripple Labs is currently sitting on around $20 billion worth of the cryptocurrency (note: Ripple’s price crashed hard recently, and may be worth far less than $60 billion by time you read this). It holds 55 billion XRP in an escrow account, which allows it to sell up to a billion per month if it so chooses in order to fund new projects and acquisitions. Selling such an amount would likely have a drastic effect on the cryptocurrency’s value, and isn’t something Ripple Labs plans to do anytime soon.\r\n\r\nIn actuality, Ripple Labs is looking to leverage the technology behind XRP to allow for faster banking transactions around the world. While Bitcoin and other cryptocurrencies are built on the idea of separating financial transactions from the financial organizations of traditional currencies, Ripple is almost the opposite in every sense.\r\n\r\nXRP by Ripple price can be found on this page alongside the market capitalization and additional stats.\r\n\r\n",
        "current_price": 2.49,
        "price_change_24h": -3.51167,
        "high_24h": 2.58,
        "low_24h": 2.39,
        "market_cap": 149186659886.0,
        "categories": [
            "FTX Holdings",
            "Pantera Capital Portfolio",
            "Andreessen Horowitz (a16z) Portfolio",
            "XRP Ledger Ecosystem",
            "GMCI 30 Index",
            "Blockchain Capital Portfolio",
            "GMCI Index",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/44/thumb/xrp-symbol-white-128.png?1696501442",
        "coin_page_id": 6
    },
    "DOT": {
        "coin_name": "Polkadot",
        "description": "Polkadot is a platform that allows diverse blockchains to transfer messages, including value, in a trust-free fashion; sharing their unique features while pooling their security. In brief, Polkadot is a scalable heterogeneous multi-chain technology.\r\n\r\nPolkadot is heterogeneous because it is entirely flexible and makes no assumption about the nature or structure of the chains in the network. Even non-blockchain systems or data structures can become parachains if they fulfill a set of criteria.\r\n\r\nPolkadot may be considered equivalent to a set of independent chains (e.g. a set containing Ethereum, Ethereum Classic, Namecoin and Bitcoin) except with important additions: pooled security and trust-free interchain transactability.\r\n\r\nMany of the native parachains of Polkadot will be written using a Polkadot Runtime Environment SDK (e.g. Parity Technologies' Substrate).",
        "current_price": 2.9,
        "price_change_24h": -4.52551,
        "high_24h": 3.03,
        "low_24h": 2.79,
        "market_cap": 4410482525.0,
        "categories": [
            "Smart Contract Platform",
            "Polkadot Ecosystem",
            "BNB Chain Ecosystem",
            "Arbitrum Ecosystem",
            "Ethereum Ecosystem",
            "Optimism Ecosystem",
            "Base Ecosystem",
            "Proof of Stake (PoS)",
            "Layer 0 (L0)",
            "Pantera Capital Portfolio",
            "GMCI 30 Index",
            "GMCI Index",
            "Made in USA",
            "Coinbase 50 Index",
            "Governance"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/12171/thumb/polkadot.png?1696512008",
        "coin_page_id": 7
    },
    "DOGE": {
        "coin_name": "Dogecoin",
        "description": "Dogecoin is a cryptocurrency based on the popular \"Doge\" Internet meme and features a Shiba Inu on its logo. Dogecoin is a Litecoin fork. Introduced as a \"joke currency\" on 6 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014. Compared with other cryptocurrencies, Dogecoin had a fast initial coin production schedule: 100 billion coins were in circulation by mid-2015, with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin had been mined. \r\n\r\nDogecoin was created by Billy Markus from Portland, Oregon and  Jackson Palmer from Sydney, Australia. Both wanted to create a fun cryptocurrency that will appeal beyond the core Bitcoin audience. Dogecoin is primarily used as a tipping system on Reddit and Twitter where users tip each other for creating or sharing good content. The community is very active in organising fundraising activities for deserving causes.\r\n\r\nThe developers of Dogecoin haven’t made any major changes to the coin since 2015. This means that Dogecoin could get left behind and is why Shibas are leaving Dogecoin to join more advanced platforms like Ethereum. One of Dogecoin strengths is its relaxed and fun-loving community. However, this is also a weakness because other currencies are way more professional.\r\n\r\nTo purchase Dogecoin, it involves downloading a crypto wallet, setting up a crypto exchange account and then trading away for your desired crypto currency. Once we have set up an account with a DOGE currency exchange and deposited some funds, you are ready to start trading. ",
        "current_price": 0.185476,
        "price_change_24h": -2.64514,
        "high_24h": 0.190515,
        "low_24h": 0.176998,
        "market_cap": 28094660667.0,
        "categories": [
            "Smart Contract Platform",
            "Meme",
            "Dog-Themed",
            "Elon Musk-Inspired",
            "Proof of Work (PoW)",
            "GMCI Meme Index",
            "GMCI 30 Index",
            "GMCI Index",
            "Coinbase 50 Index",
            "4chan-Themed"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/5/thumb/dogecoin.png?1696501409",
        "coin_page_id": 8
    },
    "FTM": {
        "coin_name": "Fantom",
        "description": "FANTOM is a new DAG based Smart Contract platform that intends to solve the scalability issues of existing public distributed ledger technologies. \r\n\r\nThe platform intends to distinguish itself from the traditional block ledger-based storage infrastructure by attempting to employ an improved version of existing DAG-based pro-tocols. The FANTOM platform adopts a new protocol known as the “Lachesis Protocol” to maintain consensus. This protocol is intended to be integrated into the Fantom OPERA Chain. The aim is to allow applications built on top of the FANTOM OPERA Chain to enjoy instant transactions and near zero transaction costs for all users. \r\n\r\nThe mission of FANTOM is to provide compatibility between all transaction bodies around the world, and create an ecosystem which allows real-time transactions and data sharing with low cost.",
        "current_price": 0.157696,
        "price_change_24h": -16.91702,
        "high_24h": 0.194527,
        "low_24h": 0.14747,
        "market_cap": 0.0,
        "categories": [
            "Infrastructure",
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Alameda Research Portfolio",
            "GMCI Layer 1 Index",
            "GMCI Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/4001/thumb/Fantom_round.png?1696504642",
        "coin_page_id": 9
    },
    "LTC": {
        "coin_name": "Litecoin",
        "description": "Litecoin is a peer-to-peer cryptocurrency created by Charlie Lee. It was created based on the Bitcoin protocol but differs in terms of the hashing algorithm used. Litecoin uses the memory intensive Scrypt proof of work mining algorithm. Scrypt allows consumer-grade hardware such as GPU to mine those coins.\r\n\r\nWhy Litecoin?\r\nLitecoin is a cryptocurrency that has evolved from Bitcoin after its own popularity in the industry, this alternative, or ‘altcoin’ has emerged to allow investors to diversify their digital currency package, according to Investopedia. Litecoin is one of the most prominent altcoins and was created by former Google employee and Director of Engineering at Coinbase, Charlie Lee. Litecoin was the first to alter Bitcoin and the most significant difference is that it takes 2.5 minutes for Litecoin to generate a block, or transaction, in comparison to Bitcoin's 10 minutes.\r\n\r\n‘While this matters little to traders, miners who use hardware to run Bitcoin's network cannot switch over to Litecoin. This keeps bigger mining conglomerates away from Litecoin because they cannot easily optimize their profits by swapping to another coin, contributing to a more decentralized experience. Litecoin also has bigger blocks, and more coins in circulation, making it more affordable and swift when transacting,’ Investopedia explained.\r\n\r\nAs explained above, Litecoin can transact a lot faster than Bitcoin, but there are also a number of other characteristics that investors need to know before trading. Litecoin can handle higher volumes of transactions because of the capability of transacting faster and if Bitcoin attempted to transact on the scale of its altcoin, a code update would be needed. However, Litecoin’s blocks would be larger, but with more ‘orphaned blocks'. The faster block time of litecoin reduces the risk of double spending attacks - this is theoretical in the case of both networks having the same hashing power.\r\n\r\nLitecoin Technical Details:\r\nThe transaction confirmation time taken for Litecoin is about 2.5 minutes on average (as compared to Bitcoin's 10 minutes). The Litecoin network is scheduled to cap at 84 million currency units. \r\n\r\nLitecoin has inspired many other popular alternative currencies (eg. Dogecoin) because of its Scrypt hashing algorithm in order to prevent ASIC miners from mining those coins. However it is said that by the end of this year, Scrypt ASIC will enter the mass market.",
        "current_price": 94.47,
        "price_change_24h": -3.33194,
        "high_24h": 97.72,
        "low_24h": 90.65,
        "market_cap": 7223849046.0,
        "categories": [
            "Infrastructure",
            "Smart Contract Platform",
            "Privacy",
            "Layer 1 (L1)",
            "Proof of Work (PoW)",
            "GMCI 30 Index",
            "GMCI Index",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/2/thumb/litecoin.png?1696501400",
        "coin_page_id": 10
    },
    "AVAX": {
        "coin_name": "Avalanche",
        "description": "Avalanche is a high throughput smart contract blockchain platform. Validators secure the network through a proof-of-stake consensus protocol. It is said to be fast, low cost, and environmental friendly.",
        "current_price": 18.29,
        "price_change_24h": -6.37048,
        "high_24h": 19.54,
        "low_24h": 17.61,
        "market_cap": 7808596542.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Avalanche Ecosystem",
            "Proof of Stake (PoS)",
            "DragonFly Capital Portfolio",
            "DeFiance Capital Portfolio",
            "Andreessen Horowitz (a16z) Portfolio",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "Galaxy Digital Portfolio",
            "GMCI Index",
            "Polychain Capital Portfolio",
            "World Liberty Financial Portfolio",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/12559/thumb/Avalanche_Circle_RedWhite_Trans.png?1696512369",
        "coin_page_id": 11
    },
    "USDC": {
        "coin_name": "USD Coin",
        "description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy.",
        "current_price": 0.999804,
        "price_change_24h": -0.00318,
        "high_24h": 0.999902,
        "low_24h": 0.999692,
        "market_cap": 75867754400.0,
        "categories": [
            "Stablecoins",
            "USD Stablecoin",
            "Solana Ecosystem",
            "Avalanche Ecosystem",
            "Polygon Ecosystem",
            "Near Protocol Ecosystem",
            "Arbitrum Ecosystem",
            "Celo Ecosystem",
            "Moonriver Ecosystem",
            "Ethereum Ecosystem",
            "XDC Ecosystem",
            "Algorand Ecosystem",
            "Optimism Ecosystem",
            "Aptos Ecosystem",
            "ZkSync Ecosystem",
            "Sui Ecosystem",
            "Base Ecosystem",
            "Tron Ecosystem",
            "Hedera Ecosystem",
            "Stellar Ecosystem",
            "XRP Ledger Ecosystem",
            "Sonic Ecosystem",
            "Fiat-backed Stablecoin",
            "Sei Network Ecosystem",
            "World Chain Ecosystem",
            "World Liberty Financial Portfolio",
            "Ink Ecosystem",
            "Made in USA",
            "Unichain Ecosystem",
            "HyperEVM Ecosystem",
            "Plume Network Ecosystem"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/6319/thumb/usdc.png?1696506694",
        "coin_page_id": 12
    },
    "TRX": {
        "coin_name": "TRON",
        "description": "What is Tron?\r\nTron's mission is to build a truly decentralized internet and aims to be the largest blockchain-based operating system in the world, known as the TRON protocol. The TRON protocol will offer high scalability, high availability, and high throughput computing to serve decentralized applications via smart contracts. Ethereum EVM-based smart contracts will be compatible and deployable on the TRON network as such Solidity developers do not have to rewrite their applications.\r\n\r\nWhy Tron?\r\nSince TRON protocol does not rely on proof of work or mining, instead governed by nodes located around the world, it is decentralized while providing high throughput for transactions on the blockchain. This is suitable for dapps that require high speed transactions especially games. There are a number of tokens already issued on the TRON network and the decentralized exchanges TRX.market has launched.\r\n\r\nOn July 24th 2018, TRON acquired BitTorrent, one of the largest P2P file sharing protocol. As a result of the acquisition, BitTorrent Token (BTT) was launched as the cryptocurrency to power the economics on the BitTorrent network. The Token will be used to inceltivize file sharing and storage within the network.\r\n",
        "current_price": 0.295035,
        "price_change_24h": -0.60743,
        "high_24h": 0.296838,
        "low_24h": 0.288681,
        "market_cap": 27928960599.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Alleged SEC Securities",
            "FTX Holdings",
            "DWF Labs Portfolio",
            "Tron Ecosystem",
            "Proof of Stake (PoS)",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "GMCI Index",
            "World Liberty Financial Portfolio",
            "Made in China"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/1094/thumb/tron-logo.png?1696502193",
        "coin_page_id": 13
    },
    "LINK": {
        "coin_name": "Chainlink",
        "description": "What is Chainlink?\r\nChainlink is the industry-standard oracle platform bringing the capital markets onchain and powering the majority of decentralized finance (DeFi). Chainlink stands to benefit the most from emerging blockchain-industry trends, such as stablecoin adoption, real-world asset tokenization, and institutional adoption of blockchain technology. Chainlink is powered by the LINK token, which is used to pay for platform services and secure the network’s proper functioning. Chainlink leverages a novel fee model where offchain and onchain revenue from enterprise adoption is converted to LINK tokens and stored in a strategic Chainlink Reserve. \r\n\r\nChainlink is at the forefront of financial innovation and the global tokenization trend. Traditional financial institutions and infrastructures, such as Swift, DTCC, Euroclear, J.P. Morgan, Mastercard, Central Bank of Brazil, UBS, SBI, Fidelity International, ANZ,  and many others are adopting Chainlink as fundamental infrastructure as they move toward tokenizing trillions onchain. Demand for Chainlink has already generated hundreds of millions of dollars in revenue across a variety of traditional and decentralized use cases.\r\n\r\n\r\nChainlink is the only all-in-one platform that fulfills the requirements of any institutional blockchain use case. The Chainlink platform enables developers and institutions to access all the critical data, interoperability, compute, compliance, privacy, and legacy-system connectivity required for advanced blockchain applications that link the onchain and offchain worlds. Chainlink solves four fundamental problems for institutions interacting with tokenized assets:\r\n\r\nThe data problem. Tokenized assets need real-world information to be usable in transactions, such as market pricing, reference data, and proof of reserves data. Chainlink is the market leader in bringing real-world data onchain securely and accurately.\r\nThe liquidity problem. Financial institutions need tokenized assets that can be securely accessed and moved across blockchain networks in order to maximize liquidity. Chainlink CCIP is the only cross-chain interoperability standard that securely connects any public or private blockchain, opening up global markets for tokenized assets.\r\nThe synchronization problem. Tokenized assets must remain synchronized with legacy systems once issued across multiple chains. Chainlink is the only platform that offers reliable offchain data, system connectivity, and secure cross-chain interoperability, enabling a Unified Golden Record that stays with assets anywhere.\r\nThe compliance problem. Regulated institutions require compliance enforcement capabilities such as identity verification (KYC), risk screening (AML), exploit protection, and asset-specific restrictions. The Chainlink Automated Compliance Engine extends existing financial infrastructure for identity and compliance data to blockchains and tokenized assets.\r\n\r\nSince launch, the Chainlink standard has securely enabled tens of trillions in transaction value across dozens of blockchains and published tens of billions of verified messages onchain. Chainlink actively secures the large majority of DeFi protocols across different blockchains, with near total dominance on Ethereum. As a chain-agnostic platform with thousands of users across the world’s largest financial institutions and DeFi protocols, Chainlink accelerates the adoption of blockchain ecosystems and is used by tens of thousands of developers, including protocols such as Aave, GMX, Lido, and many more.\r\nHow does Chainlink work?\r\nChainlink is a set of open standards for onchain data, cross-chain interoperability, and offchain computation. The platform is powered by decentralized oracle networks (DONs), which are composed of independent oracle node operators that come to consensus over any arbitrary input to deliver highly secure and reliable data, computation, and value to its intended destination. Chainlink node operators include traditional Web2 telecommunication providers, leading data providers, and Web3 infrastructure providers such as Deutsche Telekom, Swisscom, Vodafone, and Infura.\r\n\r\n\r\nThe Chainlink data standard, including Data Feeds and Data Streams, is used to supply DeFi with financial market data; tokenized assets with proof of reserve (PoR), net asset value (NAV), assets under management (AUM); traditional institutions with identity and compliance data; and decentralized applications (dApps) with virtually any type of data point they need to function. \r\nThe Chainlink interoperability standard, powered by the Cross-Chain Interoperability Protocol (CCIP), enables data and value to move seamlessly across any public and private blockchain, as well as facilitates communication between blockchains and traditional systems, such as banks, governments, and enterprises. CCIP secures tens of billions of dollars in asset value and has enabled the transfer of billions of dollars in cross-chain value.\r\nThe Chainlink compute standard, powered by the Chainlink Runtime Environment (CRE) enables developers to easily build an application that combines any data, any blockchain, any legacy systems, and computation into a unified application. With CRE, developers can easily adapt the application to support new connections without having to rewrite the app.\r\nWhat is the LINK token?\r\nLINK is the native token of the Chainlink Network, used for both payments and staking. Users can pay for Chainlink services in LINK tokens or in alternative assets (e.g., gas tokens) that are automatically converted into LINK via Payment Abstraction and stored in a strategic Chainlink Reserve. The Reserve is designed to support the long-term growth and sustainability of the Chainlink Network by accumulating LINK tokens using offchain revenue from large enterprises that are adopting the Chainlink standard and from onchain service usage, which has already generated hundreds of millions in revenue. Network service providers, such as node operators and LINK Stakers, also earn rewards in LINK tokens, which can be staked to support the cryptoeconomic security of the Chainlink Network.\r\n\r\nThe Chainlink platform supports a range of billing and payment models, including usage-based payments (e.g., subscription contracts and per-call models), revenue-sharing agreements (e.g., percentage of application revenue or recaptured MEV), Chainlink Build (i.e., a program where projects allocate a portion of their token supply), and Chainlink Scale (i.e., a program where blockchain ecosystems cover Chainlink service operating costs). \r\nChainlink Staking adds an additional layer of cryptoeconomic security to the Chainlink Network where LINK is staked (locked up) and can be slashed (forfeited) as a penalty if service providers fail to meet predefined performance requirements. Both node operators and community stakers play a critical role in supporting the reliability and integrity of the Chainlink Network.\r\n",
        "current_price": 17.22,
        "price_change_24h": -5.12507,
        "high_24h": 18.15,
        "low_24h": 16.38,
        "market_cap": 11997985320.0,
        "categories": [
            "Business Services",
            "Education",
            "Energy",
            "Entertainment",
            "Healthcare",
            "Infrastructure",
            "Internet of Things (IOT)",
            "Decentralized Finance (DeFi)",
            "Marketing",
            "Oracle",
            "BNB Chain Ecosystem",
            "Solana Ecosystem",
            "Avalanche Ecosystem",
            "Polygon Ecosystem",
            "Near Protocol Ecosystem",
            "Gnosis Chain Ecosystem",
            "Fantom Ecosystem",
            "Harmony Ecosystem",
            "Arbitrum Ecosystem",
            "Celo Ecosystem",
            "Moonriver Ecosystem",
            "Moonbeam Ecosystem",
            "Ethereum Ecosystem",
            "Cronos Ecosystem",
            "Metis Ecosystem",
            "Optimism Ecosystem",
            "Kaia Ecosystem",
            "ZkSync Ecosystem",
            "Real World Assets (RWA)",
            "Mantle Ecosystem",
            "Linea Ecosystem",
            "Base Ecosystem",
            "Shibarium Ecosystem",
            "Ronin Ecosystem",
            "Starknet Ecosystem",
            "Osmosis Ecosystem",
            "Hedera Ecosystem",
            "Scroll Ecosystem",
            "Berachain Ecosystem",
            "Merlin Chain Ecosystem",
            "Blast Ecosystem",
            "WEMIX Ecosystem",
            "Cross-chain Communication",
            "Mode Ecosystem",
            "Zora Ecosystem",
            "Bitlayer Ecosystem",
            "Core Ecosystem",
            "Energi Ecosystem",
            "Sora Ecosystem",
            "Polygon zkEVM Ecosystem",
            "Huobi ECO Chain Ecosystem",
            "Milkomeda (Cardano) Ecosystem",
            "Astar Ecosystem",
            "opBNB Ecosystem",
            "Rootstock Ecosystem",
            "NEO Ecosystem",
            "Fraxtal Ecosystem",
            "X Layer Ecosystem",
            "GMCI DeFi Index",
            "GMCI 30 Index",
            "Sonic Ecosystem",
            "Etherlink Ecosystem",
            "RWA Protocol",
            "Synthetic",
            "GMCI Index",
            "Zircuit Ecosystem",
            "Cronos zkEVM Ecosystem",
            "Sei Network Ecosystem",
            "Mint Ecosystem",
            "World Chain Ecosystem",
            "ApeChain Ecosystem",
            "Kroma Ecosystem",
            "BSquared Network Ecosystem",
            "World Liberty Financial Portfolio",
            "Abstract Ecosystem",
            "Ink Ecosystem",
            "Soneium Ecosystem",
            "Lisk Ecosystem",
            "Made in USA",
            "Unichain Ecosystem",
            "HyperEVM Ecosystem",
            "Coinbase 50 Index",
            "Corn Ecosystem",
            "Chain Abstraction",
            "Superseed Ecosystem",
            "Lens Ecosystem",
            "Plume Network Ecosystem",
            "Hydration Ecosystem",
            "Hemi Ecosystem",
            "Katana Ecosystem",
            "Botanix Ecosystem",
            "HashKey Chain Ecosystem",
            "Plasma Ecosystem"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/877/thumb/Chainlink_Logo_500.png?1760023405",
        "coin_page_id": 14
    },
    "BCH": {
        "coin_name": "Bitcoin Cash",
        "description": "Bitcoin Cash is a hard fork of Bitcoin with a protocol upgrade to fix on-chain capacity. Bitcoin Cash intends to be a Bitcoin without Segregated Witness (SegWit) as soft fork, where upgrades of the protocol are done mainly through hard forks and without changing the original economic rules of the Bitcoin.\r\n\r\nBitcoin Cash (BCH) is released on 1st August 2017 as an upgraded version of the original Bitcoin Core software. The main upgrade is the increase in the block size limit from 1MB to 8MB. This effectively allows miners on the BCH chain to process up to 8 times more payments per second in comparison to Bitcoin. This makes for faster, cheaper transactions and a much smoother user experience.\r\n\r\nWhy was Bitcoin Cash Created?\r\n\r\nThe main objective of Bitcoin Cash is to to bring back the essential qualities of money inherent in the original Bitcoin software. Over the years, these qualities were filtered out of Bitcoin Core and progress was stifled by various people, organizations, and companies involved in Bitcoin protocol development. The result is that Bitcoin Core is currently unusable as money due to increasingly high fees per transactions and transfer times taking hours to complete. This is all because of the 1MB limitation of Bitcoin Core’s block size, causing it unable to accommodate to large number of transactions.\r\n\r\nEssentially Bitcoin Cash is a community-activated upgrade (otherwise known as a hard fork) of Bitcoin that increased the block size to 8MB, solving the scaling issues that plague Bitcoin Core today.\r\n\r\nNov 16th 2018: A hashwar resulted in a split between Bitcoin SV and Bitcoin ABC",
        "current_price": 553.17,
        "price_change_24h": -2.8782,
        "high_24h": 569.56,
        "low_24h": 529.29,
        "market_cap": 11033780128.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Bitcoin Fork",
            "Proof of Work (PoW)",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/780/thumb/bitcoin-cash-circle.png?1696501932",
        "coin_page_id": 15
    },
    "XLM": {
        "coin_name": "Stellar",
        "description": "The Stellar network is an open source, distributed, and community owned network used to facilitate cross-asset transfers of value. Stellar aims to help facilitate cross-asset transfer of value at a fraction of a penny while aiming to be an open financial system that gives people of all income levels access to low-cost financial services. Stellar can handle exchanges between fiat-based currencies and between cryptocurrencies. Stellar.org, the organization that supports Stellar, is centralized like XRP and meant to handle cross platform transactions and micro transactions like XRP. However, unlike Ripple, Stellar.org is non-profit and their platform itself is open source and decentralized. \r\n\r\nStellar was founded by Jed McCaleb in 2014. Jed McCaleb is also the founder of Mt. Gox and co-founder of Ripple, launched the network system Stellar with former lawyer Joyce Kim. Stellar is also a payment technology that aims to connect financial institutions and drastically reduce the cost and time required for cross-border transfers. In fact, both payment networks used the same protocol initially.\r\n\r\nDistributed Exchange\r\nThrough the use of its intermediary currency Lumens (XLM), a user can send any currency that they own to anyone else in a different currency.\r\n\r\nFor instance, if Joe wanted to send USD to Mary using her EUR, an offer is submitted to the distributed exchange selling USD for EUR. This submitted offer forms is known as an order book. The network will use the order book to find the best exchange rate for the transaction in-order to minimize the fee paid by a user.\r\n\r\nThis multi-currency transaction is possible because of \"Anchors\". Anchors are trusted entities that hold people’s deposits and can issue credit. In essence, Anchors serves as the bridge between different currencies and the Stellar network.\r\n\r\nLumens (XLM)\r\nLumens are the native asset (digital currency) that exist on the Stellar network that helps to facilitate multi-currency transactions and prevent spams. For multi-currency transactions, XLM is the digital intermediary that allows for such a transaction to occur at a low cost.\r\n\r\nIn-order to prevent DoS attacks (aka spams) that would inevitably occur on the Stellar network, a small fee of 0.00001 XLM is associated with every transaction that occurs on the network. This fee is small enough so it does not significantly affect the cost of transaction, but large enough so it dissuades bad actors from spamming the network. \r\n\r\nPrior to Protocol 12, Stellar had a built-in inflation mechanism conceived to allow account holders to collectively direct inflation-generated lumens toward projects built on Stellar.\r\n\r\nAs the network evolved and grew, it became increasingly clear that inflation wasn’t working as intended — account holders either didn’t set their inflation destination or joined inflation pools to claim the inflation themselves, and the operational costs associated with inflation payments continued to rise — and so a protocol change to disable inflation was proposed, implemented, voted on by validators, and ultimately adopted as part of a network upgrade.\r\n\r\nThe inflation operation is now deprecated.\r\nhttps://developers.stellar.org/docs/glossary/inflation/\r\n",
        "current_price": 0.301484,
        "price_change_24h": -4.0451,
        "high_24h": 0.314193,
        "low_24h": 0.291118,
        "market_cap": 9659352507.0,
        "categories": [
            "Smart Contract Platform",
            "Real World Assets (RWA)",
            "Stellar Ecosystem",
            "GMCI 30 Index",
            "GMCI Index",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/100/thumb/fmpFRHHQ_400x400.jpg?1735231350",
        "coin_page_id": 16
    },
    "SHIB": {
        "coin_name": "Shiba Inu",
        "description": "Shiba Inu (SHIB) is a meme token which began as a fun currency and has now transformed into a decentralized ecosystem. During the initial launch, 50% of the supply was allocated into Vitalik Buterin's ethereum wallet. \r\n\r\nAs a result of that, Vitalik proceeded to donate 10% of his SHIB holdings to a COVID-19 relief effort in India and the remaining 40% is burnt forever. That donation was worth about $1 billion at that time, which makes it one of the largest donation ever in the world.\r\n\r\nWhat is the Shiba Inu community working on right now? The Shiba Inu team launched a decentralized exchange called Shibaswap with 2 new tokens, LEASH and BONE. LEASH is a scarce supply token that is used to offer incentives on Shibaswap. BONE is the governance token for holders to vote on proposals on Doggy DAO.",
        "current_price": 9.87e-06,
        "price_change_24h": -1.83018,
        "high_24h": 1.005e-05,
        "low_24h": 9.41e-06,
        "market_cap": 5816727333.0,
        "categories": [
            "Meme",
            "Ethereum Ecosystem",
            "Animoca Brands Portfolio",
            "Dog-Themed",
            "GMCI Meme Index",
            "GMCI 30 Index",
            "GMCI Index",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/11939/thumb/shiba.png?1696511800",
        "coin_page_id": 17
    },
    "VET": {
        "coin_name": "VeChain",
        "description": "VeChain, founded in 2015, is a sustainability-focused blockchain driving mass adoption of Web3. Its energy-efficient VeChainThor chain delivers fast, low-cost transactions, making blockchain accessible to millions worldwide. With partnerships including UFC, BCG, and Walmart, and over 2 million active users on VeBetter-powered apps, VeChain is proving real-world impact at scale.\r\n\r\nIn 2024, the VeChain Renaissance upgrade was launched, introducing Ethereum compatibility, dPoS consensus, and dynamic gas fees. It cut VTHO inflation and introduced StarGate NFT staking, where users lock VET to mint transferable NFTs that earn VTHO, can be delegated to validators, and serve as governance instruments. The upgrade also added new eco node tiers, lowering entry barriers while keeping rewards across higher staking levels.\r\n\r\nBy combining adoption, upgraded tokenomics, and inclusive staking, VeChain is positioning itself as a leading blockchain where usage, growth, and rewards fuel long-term value creation.",
        "current_price": 0.01582498,
        "price_change_24h": -4.57279,
        "high_24h": 0.0165833,
        "low_24h": 0.01515811,
        "market_cap": 1360758893.0,
        "categories": [
            "Internet of Things (IOT)",
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "VeChain Ecosystem",
            "Made in China"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/1167/thumb/VET.png?1742383283",
        "coin_page_id": 18
    },
    "UNI": {
        "coin_name": "Uniswap",
        "description": "UNI is the governance token for Uniswap, an Automated Market Marker DEX on the Ethereum blockchain. The UNI token allows token holders to participate in the governance of the protocol. Key decisions such as usage of the treasury or future upgrades can be decided through a governance vote.",
        "current_price": 5.85,
        "price_change_24h": -3.06029,
        "high_24h": 6.04,
        "low_24h": 5.69,
        "market_cap": 3514747613.0,
        "categories": [
            "Decentralized Exchange (DEX)",
            "Exchange-based Tokens",
            "Decentralized Finance (DeFi)",
            "Yield Farming",
            "Automated Market Maker (AMM)",
            "BNB Chain Ecosystem",
            "Avalanche Ecosystem",
            "Polygon Ecosystem",
            "Near Protocol Ecosystem",
            "Gnosis Chain Ecosystem",
            "Harmony Ecosystem",
            "Arbitrum Ecosystem",
            "Ethereum Ecosystem",
            "Optimism Ecosystem",
            "Paradigm Portfolio",
            "Coinbase Ventures Portfolio",
            "Index Coop Defi Index",
            "Andreessen Horowitz (a16z) Portfolio",
            "Energi Ecosystem",
            "Sora Ecosystem",
            "Huobi ECO Chain Ecosystem",
            "GMCI DeFi Index",
            "GMCI 30 Index",
            "Blockchain Capital Portfolio",
            "GMCI Index",
            "Polychain Capital Portfolio",
            "Made in USA",
            "Unichain Ecosystem",
            "Coinbase 50 Index",
            "Governance"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/12504/thumb/uniswap-logo.png?1720676669",
        "coin_page_id": 19
    },
    "XMR": {
        "coin_name": "Monero",
        "description": "Monero is a privacy-centric cryptocurrency focused on fungibility and untraceability. It uses ring signatures, RingCT (ring confidential transactions), and stealth addresses to hide sender, recipient, and amount information by default. Monero employs a PoW algorithm (RandomX) optimized for CPU mining and has an active open-source community that continually improves privacy and protocol resilience.",
        "current_price": 324.03,
        "price_change_24h": -1.50446,
        "high_24h": 328.98,
        "low_24h": 319.05,
        "market_cap": 5977124449.0,
        "categories": [
            "Smart Contract Platform",
            "Privacy",
            "Layer 1 (L1)",
            "Proof of Work (PoW)",
            "Galaxy Digital Portfolio"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/69/thumb/monero_logo.png?1696501460",
        "coin_page_id": 20
    },
    "ZEC": {
        "coin_name": "Zcash",
        "description": "Zcash is a decentralized and open-source cryptocurrency that offers privacy and selective transparency of transactions. Zcash payments are published on a public blockchain, but the sender, recipient, and amount of a transaction remain private.\r\n\r\nZcash is based on peer-reviewed cryptographic research, and built by a security-specialized engineering team on an open source platform based on Bitcoin Core's battle-tested codebase. Our improvement over Bitcoin is the addition of privacy. Zcash uses advanced cryptographic techniques, namely zero-knowledge proofs, to guarantee the validity of transactions without revealing additional information about them.\r\n\r\nHow Zcash works\r\n\r\nZcash encrypts the contents of shielded transactions. Since the payment information is encrypted, the protocol uses a novel cryptographic method to verify their validity.\r\n\r\nZcash uses a zero-knowledge proof construction called a zk-SNARK, developed by our team of experienced cryptographers based on recent breakthroughs in cryptography. These constructions allow the network to maintain a secure ledger of balances without disclosing the parties or amounts involved. Instead of publicly demonstrating spend-authority and transaction values, the transaction metadata is encrypted and zk-SNARKs are used to prove that nobody is cheating or stealing.\r\n\r\nZcash also enables users to send public payments which work similarly to Bitcoin. With the support for both shielded and transparent addresses, users can choose to send Zcash privately or publicly. Zcash payments sent from a shielded address to a transparent address reveal the received balance, while payments from a transparent address to a shielded address protect the receiving value. \r\n\r\nCheck out CoinBureau for guide on What is ZCash.",
        "current_price": 381.04,
        "price_change_24h": 5.64848,
        "high_24h": 387.92,
        "low_24h": 303.79,
        "market_cap": 6233477922.0,
        "categories": [
            "Smart Contract Platform",
            "Privacy",
            "Layer 1 (L1)",
            "Near Protocol Ecosystem",
            "Zero Knowledge (ZK)",
            "Proof of Work (PoW)",
            "Pantera Capital Portfolio",
            "Made in USA",
            "Coinbase 50 Index"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/486/thumb/circle-zcash-color.png?1696501740",
        "coin_page_id": 21
    },
    "APT": {
        "coin_name": "Aptos",
        "description": "Aptos is a new, independent high-performance PoS Layer 1 project focused on delivering the safest and most scalable Layer 1 blockchain in the world. The Aptos blockchain leverages the Move programming language and the Move VM for application development, which are created and optimized for blockchain use cases.The team is comprised of the original creators, researchers, designers, and builders of Diem, the blockchain that was first built to serve this purpose. Aptos raised $200m from a16z, Multicoin, Binance and others. Aptos launched Devnet in mid March, incentivized testnet in late May and targets Q3 for mainnet launch. ",
        "current_price": 3.22,
        "price_change_24h": -5.98632,
        "high_24h": 3.43,
        "low_24h": 3.08,
        "market_cap": 2315309876.0,
        "categories": [
            "Smart Contract Platform",
            "Layer 1 (L1)",
            "Aptos Ecosystem",
            "FTX Holdings",
            "Coinbase Ventures Portfolio",
            "Multicoin Capital Portfolio",
            "Proof of Stake (PoS)",
            "DragonFly Capital Portfolio",
            "Andreessen Horowitz (a16z) Portfolio",
            "YZi Labs (Prev. Binance Labs) Portfolio",
            "GMCI Layer 1 Index",
            "GMCI 30 Index",
            "Circle Ventures Portfolio",
            "GMCI Index",
            "Made in USA"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/26455/thumb/Aptos-Network-Symbol-Black-RGB-1x.png?1761789140",
        "coin_page_id": 22
    },
    "FIL": {
        "coin_name": "Filecoin",
        "description": "The Filecoin network achieves staggering economies of scale by allowing anyone worldwide to participate as storage providers. It also makes storage resemble a commodity or utility by decoupling hard-drive space from additional services. On this robust global market the price of storage will be driven by supply and demand, not corporate pricing departments, and miners will compete on factors like reputation for reliability as well as price.",
        "current_price": 1.5,
        "price_change_24h": -2.8174,
        "high_24h": 1.55,
        "low_24h": 1.41,
        "market_cap": 1055652750.0,
        "categories": [
            "Infrastructure",
            "Smart Contract Platform",
            "Storage",
            "Layer 1 (L1)",
            "DePIN",
            "Alleged SEC Securities",
            "Pantera Capital Portfolio",
            "GMCI DePIN Index",
            "GMCI 30 Index",
            "Sequoia Capital Portfolio",
            "Blockchain Capital Portfolio",
            "GMCI Index",
            "Made in USA"
        ],
        "img_url": "https://coin-images.coingecko.com/coins/images/12817/thumb/filecoin.png?1696512609",
        "coin_page_id": 23
    }
}